app/views/movies/_movies_list.html.erb

	  	<div class="ficha-img">
	  		<%if movie.photo_movies.count>0%>
---
SELECT "movies".* FROM "movies"