app/views/link_series/index.html.erb

<% unless @series.link_series.blank? %>
---
SELECT "link_series".* FROM "link_series" WHERE "link_series"."series_id" = ?  [["series_id", 1]]