app/controllers/episodes_controller.rb

  def index
    if @parent
      @episodes = @parent.episodes
    else
      @episodes = Episode.all
---
SELECT "episodes".* FROM "episodes"

  def show
    @reviews=@episode.reviews
    if current_user
      if current_user_is_admin?
        @photo_episodes_current_user=@episode.photo_episodes
      else
        @photo_episodes_current_user=@episode.photo_episodes.where(:user_id => current_user.id)
      end
      @review = @episode.reviews.find_by(user_id: current_user.id)
      @trailer = Trailer.find_by(episode: @episode, user: current_user)
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."episode_id" = ? AND "reviews"."user_id" = 3 LIMIT 1  [["episode_id", 1]]
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "trailers".* FROM "trailers" WHERE "trailers"."episode_id" = 1 AND "trailers"."user_id" = 3 LIMIT 1

  def create

    if @parent
      @episode = @parent.episodes.new(episode_params)
    else
      @episode = Episode.new(episode_params)
    end

    respond_to do |format|
      if @episode.save
---
INSERT INTO "episodes" ("created_at", "description", "name", "number", "release_date", "season_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def add_trailer
    @trailer = Trailer.create(url: params[:video_url], episode: @episode, user: current_user)
---
INSERT INTO "trailers" ("created_at", "episode_id", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Dec 2013 04:27:49 UTC +00:00], ["episode_id", 1], ["updated_at", Sun, 08 Dec 2013 04:27:49 UTC +00:00], ["url", "//www.youtube.com/embed/porIM7qtN38"], ["user_id", 3]]

  def remove_trailer
    Trailer.find_by(episode: @episode, user: current_user).destroy
---
DELETE FROM "trailers" WHERE "trailers"."id" = ?  [["id", 10]]
SELECT "trailers".* FROM "trailers" WHERE "trailers"."episode_id" = 1 AND "trailers"."user_id" = 3 LIMIT 1

    def set_episode
      @episode = Episode.find(params[:id])
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."id" = ? LIMIT 1  [["id", "1"]]