app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"
---
  def index
    if @parent
      @movies = @parent.movies
    else
      @movies = Movie.all

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."user_id" = 3 LIMIT 1  [["movie_id", 3]]
SELECT "trailers".* FROM "trailers" WHERE "trailers"."movie_id" = ? AND "trailers"."user_id" = 3 LIMIT 1  [["movie_id", 3]]
---
  def show
    @reviews = Review.where(movie: @movie)
    if current_user
      @review = @movie.reviews.find_by(user_id: current_user.id)
      if current_user_is_admin?
        @photo_movies_current_user=@movie.photo_movies
      else
        @photo_movies_current_user=@movie.photo_movies.where(:user_id => current_user.id)
      end
      if not @review
        @review = Review.new
      end
      @trailer = Trailer.find_by(user: current_user,movie: @movie)

INSERT INTO "trailers" ("created_at", "movie_id", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Dec 2013 04:05:32 UTC +00:00], ["movie_id", 3], ["updated_at", Sun, 08 Dec 2013 04:05:32 UTC +00:00], ["url", "//www.youtube.com/embed/vak9ZLfhGnQ"], ["user_id", 3]]
---
  def add_trailer
    @trailer = Trailer.create(url: params[:video_url], movie: @movie, user: current_user)

SELECT "trailers".* FROM "trailers" WHERE "trailers"."movie_id" = 3 AND "trailers"."user_id" = 3 LIMIT 1
DELETE FROM "trailers" WHERE "trailers"."id" = ?  [["id", 4]]
---
  def remove_trailer
    @trailer = Trailer.find_by(movie: @movie, user: current_user)
    @trailer.destroy

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
---
    def set_movie
      @movie = Movie.find(params[:id])