app/controllers/photo_shows_controller.rb

INSERT INTO "photo_shows" ("created_at", "data_content_type", "data_file_name", "data_file_size", "data_updated_at", "description", "show_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @photo_show = PhotoShow.new(photo_show_params)
    @photo_show.show=@parent
    @photo_show.user=current_user
    respond_to do |format|
      if @photo_show.save

SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "2"]]
---
    def set_photo_show
      @photo_show = PhotoShow.find(params[:id])