app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    respond_to do |format|
      if @review.save
---
INSERT INTO "reviews" ("body", "created_at", "rating", "show_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @review.update(review_params)
---
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["rating", 5], ["updated_at", Fri, 06 Dec 2013 01:40:25 UTC +00:00]]

    def set_review
      @review = Review.find(params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT 1  [["id", "1"]]