app/controllers/seasons_controller.rb

  def show
    @episodes=Episode.find_all_by_season_id(@season.id)
    @reviews = Review.where(season: @season)

    if current_user
      if current_user_is_admin?
        @photo_seasons_current_user=@season.photo_seasons
      else
        @photo_seasons_current_user=@season.photo_seasons.where(:user_id => current_user.id)
      end
      @review = @season.reviews.find_by(user_id: current_user.id)
      if not @review
        @review = Review.new
      end
      @trailer = Trailer.find_by(season: @season, user: current_user)
---
SELECT "episodes".* FROM "episodes" WHERE "episodes"."season_id" = 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."season_id" = ? AND "reviews"."user_id" = 3 LIMIT 1  [["season_id", 1]]
SELECT "seasons".* FROM "seasons" WHERE "seasons"."id" = ? LIMIT 1  [["id", "1"]]