app/controllers/series_controller.rb

SELECT "series".* FROM "series"
---
  def index
    if @parent
      @series = @parent.series
    else
      @series = Series.all

SELECT "link_series".* FROM "link_series" WHERE "link_series"."series_id" = ?  [["series_id", 1]]
SELECT "seasons".* FROM "seasons" WHERE "seasons"."series_id" = 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."series_id" = ? AND "reviews"."user_id" = 3 LIMIT 1  [["series_id", 1]]
SELECT "series".* FROM "series" WHERE "series"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @seasons=Season.find_all_by_series_id(params[:id])
    if current_user
      if current_user_is_admin?
        @photo_series_current_user=@series.photo_series
        @reviews = @series.reviews
      else
        @photo_series_current_user=@series.photo_series.where(:user_id => current_user.id)
        @reviews = @series.reviews.find_by(user_id: current_user.id)
      end

      if not @review
        @review = Review.new
      end
      @trailer = Trailer.find_by(series: @series, user: current_user)