app/controllers/shows_controller.rb

  def index
    if params[:search]
      @shows = Show.search(params[:search])
---
SELECT "shows".* FROM "shows" WHERE (name like '%s%')

  def show
    @series= Series.find_all_by_show_id(params[:id])
    @movies= Movie.find_all_by_show_id(params[:id])

    if current_user
      @reviews = Review.where(show: @show)
      @review = @show.reviews.find_by(user_id: current_user.id)
      if current_user_is_admin?
        @photo_shows_current_user=@show.photo_shows
      else
        @photo_shows_current_user=@show.photo_shows.where(:user_id => current_user.id)
      end
      if not @review
        @review = Review.new
      end
      @trailer = Trailer.find_by(show: @show, user: current_user)
---
SELECT "link_shows".* FROM "link_shows" WHERE "link_shows"."show_id" = ?  [["show_id", 1]]
SELECT "series".* FROM "series" WHERE "series"."show_id" = 1
SELECT "movies".* FROM "movies" WHERE "movies"."show_id" = 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."show_id" = 1
SELECT "reviews".* FROM "reviews" WHERE "reviews"."show_id" = ? AND "reviews"."user_id" = 1 LIMIT 1  [["show_id", 1]]
SELECT "photo_shows".* FROM "photo_shows" WHERE "photo_shows"."show_id" = ? AND "photo_shows"."user_id" = 1  [["show_id", 1]]
SELECT "photo_shows".* FROM "photo_shows" WHERE "photo_shows"."show_id" = ?  [["show_id", 2]]
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "trailers".* FROM "trailers" WHERE "trailers"."show_id" = ? ORDER BY "trailers"."id" ASC LIMIT 1  [["show_id", 2]]

  def seen
    Seen.create(show: @show, user: current_user)
---
INSERT INTO "seens" ("created_at", "show_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 02 Dec 2013 02:02:46 UTC +00:00], ["show_id", 1], ["updated_at", Mon, 02 Dec 2013 02:02:46 UTC +00:00], ["user_id", 1]]

  def category
    @shows = Show.where(category: params[:category])
---
SELECT "shows".* FROM "shows" WHERE "shows"."category" = 'Sci-fi and Fantasy'

  def add_trailer
    @trailer = Trailer.create(url: params[:video_url], show: @show, user: current_user)
---
INSERT INTO "trailers" ("created_at", "show_id", "updated_at", "url", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sun, 08 Dec 2013 03:24:03 UTC +00:00], ["show_id", 2], ["updated_at", Sun, 08 Dec 2013 03:24:03 UTC +00:00], ["url", "//www.youtube.com/embed/x80aRLFK1x4"], ["user_id", 3]]

  def remove_trailer
    Trailer.find_by(show: @show, user: current_user).destroy
---
DELETE FROM "trailers" WHERE "trailers"."id" = ?  [["id", 2]]
SELECT "trailers".* FROM "trailers" WHERE "trailers"."show" IS NULL AND "trailers"."user_id" = 3 LIMIT 1

    def set_show
      @show = Show.find(params[:id])
---
SELECT "shows".* FROM "shows" WHERE "shows"."id" = ? LIMIT 1  [["id", "2"]]