app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Fri, 06 Dec 2013 14:45:49 UTC +00:00], ["email", "mama@casa.mundo"], ["name", "pepe"], ["password", "hola123"], ["updated_at", Fri, 06 Dec 2013 14:45:49 UTC +00:00]]