app/views/shows/index.html.erb

	  	<div class="ficha-img">
	  		<%if show.photo_shows.count>0%>
---
SELECT "photo_shows".* FROM "photo_shows" WHERE "photo_shows"."show_id" = ? ORDER BY "photo_shows"."id" ASC LIMIT 1  [["show_id", 2]]
SELECT "shows".* FROM "shows" WHERE (name like '%s%')
SELECT COUNT(*) FROM "photo_shows" WHERE "photo_shows"."show_id" = ?  [["show_id", 1]]