app/views/shows/show.html.erb

SELECT "shows".* FROM "shows" INNER JOIN "seens" ON "shows"."id" = "seens"."show_id" WHERE "seens"."user_id" = ? AND "shows"."id" = 2 ORDER BY "shows"."id" ASC LIMIT 1  [["user_id", 3]]
---
      <% if current_user %>
        <% if current_user.shows.where(id: params[:id]).first != @show %>

SELECT "watchlist_shows".* FROM "watchlist_shows" WHERE "watchlist_shows"."user_id" = 3 AND "watchlist_shows"."show_id" = 2 ORDER BY "watchlist_shows"."id" ASC LIMIT 1
---
        <% end %>
        <% if WatchlistShow.where(user: current_user, show: @show).first %>

SELECT "photo_shows".* FROM "photo_shows" WHERE "photo_shows"."show_id" = ?  [["show_id", 2]]
SELECT COUNT(*) FROM "photo_shows" WHERE "photo_shows"."show_id" = ?  [["show_id", 2]]
---
      <span class="color_azul-ficha">Pictures:</span>
      <%if @show.photo_shows.count>0%>