app/views/link_shows/index.html.erb

SELECT "link_shows".* FROM "link_shows" WHERE "link_shows"."show_id" = ?  [["show_id", 1]]
---
<% unless @show.link_shows.blank? %>