app/views/reviews/update.js.erb

<% else %>
  	$("#review-container").toggle();
---
UPDATE "reviews" SET "rating" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["rating", 5], ["updated_at", Fri, 06 Dec 2013 01:40:25 UTC +00:00]]