app/views/series/_series_list.html.erb

SELECT "series".* FROM "series"
---
	  	<div class="ficha-img">
	  		<%if series.photo_series.count>0%>